b=float(input("Здравствуйте. Введите значение первого элемента прогрессии в диапозоне от -10000 по 10000 b= "))
q=float(input("Здравствуйте. Введите значение множителя прогрессии в диапозоне от 1 по 50 q= "))
n=int(input("Здравствуйте. Введите значение последнего элемента прогрессии в диапозоне от 2 по 100 n= "))

if b >= -10000 and b<=10000:
    if q>=1 and q<=50:
        if n>=2 and n<=100:
            s=b*(1-q**n) / (1-q)
            print("Pезультат вычисления суммы геометрической прогрессии =",s)
        else:
            print("Не подходит, нужно ввести другое")
    elif q==1:
        if n>=2 and n<=100:
            s=b*n
            print("Pезультат вычисления суммы геометрической прогрессии =",s)
        else:print("Не подходит, нужно ввести другое") 
    else:print("Не подходит, нужно ввести другое") 
else:print("Не подходит, нужно ввести другое")                                                                                                                                                                                                                                                           

    